PANDAS

In [2]:
import pandas as pd

In [3]:
areas=pd.Series(data={'California':12,'Texas':1123,'New York':321})

In [4]:
areas

California      12
Texas         1123
New York       321
dtype: int64

Here keep note of the datatype, like in the above datatype is int64

In [6]:
areas.index

Index(['California', 'Texas', 'New York'], dtype='object')

In [7]:
areas.unique()

array([  12, 1123,  321], dtype=int64)

In [8]:
areas.nunique()

3

^^ This gives no. of unique values

In [12]:
print(areas)

California      12
Texas         1123
New York       321
dtype: int64

In [11]:
print(areas.iloc[2])
print(areas.loc["Texas"])

321
1123

In [13]:
areas[0:2]#Remember 2 is exclusive here!

California      12
Texas         1123
dtype: int64

IMPORTANT PARAMETERS
data-helps directly insert data in dataframes
index-helps assign a list of indices to the dataframes(customised indices as well)
columns-helps assign a list od columns to the dataframe(customised columns as well)

In [23]:
#creating a dataframe
states=pd.DataFrame({'area':areas})
states.loc[2]="States"
states

              area
California      12
Texas         1123
New York       321
2           States

In [25]:
samp=pd.DataFrame(np.random.rand(3,2),columns=['A','B'])

NameError: name 'np' is not defined

In [26]:
x=pd.DataFrame(data={'A':['A0','A1'],'B':['B0','B1']})
y=pd.DataFrame(data={'A':['C0','C1'],'B':['D0','D1']})

In [27]:
x.append(y)

    A   B
0  A0  B0
1  A1  B1
0  C0  D0
1  C1  D1

Check on how to do transform and apply on Group by data in Pandas (Home Work)

In [29]:
df=pd.read_clipboard()